#### DocumentMacroOptions Enumeration

---

|  |
| --- |
| See Also |

The document macro options.

**Namespace:**   Autodesk.Revit.DB.Macros
  **Assembly:**   RevitAPIMacros  (in RevitAPIMacros.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public enum DocumentMacroOptions ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration DocumentMacroOptions ``` |

| Visual C++ |
| --- |
| ``` public enum class DocumentMacroOptions ``` |

# Members

| Member name | Description |
| --- | --- |
| EnableMacros | The option to enable macros in the document. |
| DisableMacros | The option to disable macros in the document. |

# See Also

Autodesk.Revit.DB.Macros Namespace